OpenFOAM/OutWit.Controller.OpenFOAM.Tests/Fixtures/CouetteMrf/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType  laminar;
