OpenFOAM/OutWit.Controller.OpenFOAM.Tests/Fixtures/CouetteMrf/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  An annulus between r = 1 and r = 2, one cell deep (z = 0 .. 0.1): four
  blocks of 20 x 20 cells, every cell in the zone the MRF turns.
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    ( 1  0  0)
    ( 0  1  0)
    (-1  0  0)
    ( 0 -1  0)
    ( 2  0  0)
    ( 0  2  0)
    (-2  0  0)
    ( 0 -2  0)

    ( 1  0  0.1)
    ( 0  1  0.1)
    (-1  0  0.1)
    ( 0 -1  0.1)
    ( 2  0  0.1)
    ( 0  2  0.1)
    (-2  0  0.1)
    ( 0 -2  0.1)
);

blocks
(
    hex (1 0 4 5  9  8 12 13) rotor (20 20 1) simpleGrading (1 1 1)
    hex (2 1 5 6 10  9 13 14) rotor (20 20 1) simpleGrading (1 1 1)
    hex (3 2 6 7 11 10 14 15) rotor (20 20 1) simpleGrading (1 1 1)
    hex (0 3 7 4  8 11 15 12) rotor (20 20 1) simpleGrading (1 1 1)
);

edges
(
    arc  0  1 ( 0.70710678  0.70710678 0)
    arc  1  2 (-0.70710678  0.70710678 0)
    arc  2  3 (-0.70710678 -0.70710678 0)
    arc  3  0 ( 0.70710678 -0.70710678 0)
    arc  4  5 ( 1.41421356  1.41421356 0)
    arc  5  6 (-1.41421356  1.41421356 0)
    arc  6  7 (-1.41421356 -1.41421356 0)
    arc  7  4 ( 1.41421356 -1.41421356 0)

    arc  8  9 ( 0.70710678  0.70710678 0.1)
    arc  9 10 (-0.70710678  0.70710678 0.1)
    arc 10 11 (-0.70710678 -0.70710678 0.1)
    arc 11  8 ( 0.70710678 -0.70710678 0.1)
    arc 12 13 ( 1.41421356  1.41421356 0.1)
    arc 13 14 (-1.41421356  1.41421356 0.1)
    arc 14 15 (-1.41421356 -1.41421356 0.1)
    arc 15 12 ( 1.41421356 -1.41421356 0.1)
);

boundary
(
    innerWall
    {
        type wall;
        faces
        (
            (0 1  9  8)
            (1 2 10  9)
            (2 3 11 10)
            (3 0  8 11)
        );
    }

    outerWall
    {
        type wall;
        faces
        (
            (4 5 13 12)
            (5 6 14 13)
            (6 7 15 14)
            (7 4 12 15)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (1 0 4 5)
            (2 1 5 6)
            (3 2 6 7)
            (0 3 7 4)
            ( 9  8 12 13)
            (10  9 13 14)
            (11 10 14 15)
            ( 8 11 15 12)
        );
    }
);
